Управление_по_целям_и_KPI/src/Reports/KPI_ПланФакты/KPI_ПланФакты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>KPI_ПланФакты</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУправления</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
</mdclass:Report>

Управление_по_целям_и_KPI/src/AccumulationRegisters/KPI_Планы/KPI_Планы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>KPI_Планы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НижняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерхняяГраница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчетаСмартЗадач</name>
    <type>
      <types>EnumRef.KPI_ВидыРасчетаСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>НазваниеФильтраАналитик</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСтандартов</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦелевойПоказатель</name>
    <type>
      <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.KPI_КлючиАналитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_по_целям_и_KPI/src/AccumulationRegisters/KPI_Факты/KPI_Факты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>KPI_Факты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаСтандарта</name>
    <type>
      <types>CatalogRef.KPI_ВидыОценок</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦелевойПоказатель</name>
    <type>
      <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючАналитики</name>
    <type>
      <types>CatalogRef.KPI_КлючиАналитики</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_СтруктураКомпании/KPI_СтруктураКомпании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_СтруктураКомпании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкрытьВСтруктуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтруктураУдалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/InformationRegisters/KPI_Стандарты/KPI_Стандарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>KPI_Стандарты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Оцениваемый</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </resources>
  <resources>
    <name>ВесСтандарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесОтветственного</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Стандарт</name>
    <type>
      <types>CatalogRef.KPI_Стандарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.KPI_ВводОценокСтандартов</types>
      <types>DocumentRef.KPI_Планирование</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_по_целям_и_KPI/src/Documents/KPI_СмартЗадача/KPI_СмартЗадача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_СмартЗадача</name>
  <basedOn>Document.KPI_СмартЗадача</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.KPI_Планы</registerRecords>
  <registerRecords>AccumulationRegister.KPI_Факты</registerRecords>
  <registerRecords>InformationRegister.KPI_ИсторияСмартЗадач</registerRecords>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураКомпанииПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.KPI_ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КритерийВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Утверждено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСмартЗадач</name>
    <type>
      <types>CatalogRef.KPI_ГруппыСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.KPI_СмартЗадача</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.KPI_ВидыСвязиСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.KPI_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.KPI_Этапы</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторУтверждения</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторПроверки</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Делегирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Documents/KPI_Планирование/KPI_Планирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>KPI_Планирование</name>
  <registerRecords>AccumulationRegister.KPI_Планы</registerRecords>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.KPI_МоделиПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСмартЗадач</name>
    <type>
      <types>EnumRef.KPI_ВидыРасчетаСмартЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.KPI_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Планы</name>
    <attributes>
      <name>ЦелевойПоказатель</name>
      <type>
        <types>CatalogRef.KPI_ЦелевыеПоказатели</types>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеФильтраАналитик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючАналитики</name>
      <type>
        <types>CatalogRef.KPI_КлючиАналитики</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НижняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВерхняяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стандарты</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.KPI_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыОтветственные</name>
    <attributes>
      <name>Стандарт</name>
      <type>
        <types>CatalogRef.KPI_Стандарты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОценки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.KPI_СтруктураКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесСтандарта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_по_целям_и_KPI/src/Catalogs/KPI_Сотрудники/KPI_Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>KPI_Сотрудники</name>
  <attributes>
    <name>СтруктураКомпании</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>CatalogRef.KPI_Квалификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_по_целям_и_KPI/src/Reports/KPI_ПланФакты/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	ДокументРезультат.Автомасштаб = Истина;
	МакетПланФакты = ПолучитьМакет("ПланФакты");
	
	//
	
	
	//Выведем заголовок отчета
	
	ПредставлениеОбъектаУправления = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(ОбъектУправления,Период);
	
	ЗаголовокОтчета = СтрЗаменить(ЗаголовокОтчета, "%ПредставлениеПодразделения%",ПредставлениеОбъектаУправления);
	ПредставлениеПериода = KPI_ИнтерфейсВызовСервера.ПредставлениеПериодаПланирования(Период,ПериодичностьПланирования);
	ЗаголовокОтчета = СтрЗаменить(ЗаголовокОтчета, "%Период%", ПредставлениеПериода);
	
	ОбластьЗаголовок = МакетПланФакты.ПолучитьОбласть("ЗаголовокЦелевыеПоказатели");
	ОбластьЗаголовок.Параметры.ОбъектУправления = ПредставлениеОбъектаУправления;
	ОбластьЗаголовок.Параметры.представлениеПериода = ПредставлениеПериода;
	
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	ГраницыПериода = KPI_ОбщегоНазначенияСервер.ГраницыПериода(Период,ПериодичностьПланирования);
	//
	
	//Выведем целевые показатели
	
	ПланФакты = KPI_ОбщегоНазначенияСервер.ПолучитьПланыИФакты(Период,ГраницыПериода.НачалоПериода,
	ГраницыПериода.КонецПериода,ПериодичностьПланирования,ОбъектУправления,,Истина);
	
	ОбластьЗаголовокГруппировки = МакетПланФакты.ПолучитьОбласть("ГрупировкаЦелевыеПоказатели");
	ДокументРезультат.Вывести(ОбластьЗаголовокГруппировки);
	
	ОбластьДетальныеЗаписи = МакетПланФакты.ПолучитьОбласть("ДетальльныеЗаписиЦелевыеПоказатели");
	Для Каждого Стр из ПланФакты Цикл
		ЗаполнитьЗначенияСвойств(ОбластьДетальныеЗаписи.Параметры,Стр);
		ЗаполнитьЗначенияСвойств(ОбластьДетальныеЗаписи.Параметры,Стр.ЦелевойПоказатель);
		ДокументРезультат.Вывести(ОбластьДетальныеЗаписи);
	КонецЦикла;
	
	ОбластьПодвалПоказателей = МакетПланФакты.ПолучитьОбласть("ПодвалЦелевыеПоказатели");
	ОбластьПодвалПоказателей.Параметры.КПР = ПланФакты.Итог("КПР");
	ОбластьПодвалПоказателей.Параметры.Вес = ПланФакты.Итог("Вес");
	ДокументРезультат.Вывести(ОбластьПодвалПоказателей);
	
	//Выведем смарт задачи
	
	ОбластьЗаголовок = МакетПланФакты.ПолучитьОбласть("ЗаголовокСмартЗадачи");
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	KPI_Планы.План,
	               |	ВЫРАЗИТЬ(KPI_Планы.Регистратор КАК Документ.KPI_СмартЗадача) КАК Регистратор
	               |ПОМЕСТИТЬ СмартЗадачиПланы
	               |ИЗ
	               |	РегистрНакопления.KPI_Планы КАК KPI_Планы
	               |ГДЕ
	               |	KPI_Планы.Регистратор ССЫЛКА Документ.KPI_СмартЗадача
	               |	И KPI_Планы.СтруктураКомпании = &ОбъектУправления
	               |	И KPI_Планы.ПериодичностьПланирования = &ПериодичностьПланирования
	               |	И KPI_Планы.Регистратор.ВыполнитьДо МЕЖДУ &НачалоПериода И &КонецПериода
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(KPI_Факты.Регистратор КАК Документ.KPI_СмартЗадача) КАК Регистратор,
	               |	KPI_Факты.Факт,
	               |	KPI_Факты.СтруктураКомпании
	               |ПОМЕСТИТЬ ФактыСмартЗадач
	               |ИЗ
	               |	РегистрНакопления.KPI_Факты КАК KPI_Факты
	               |ГДЕ
	               |	KPI_Факты.Регистратор ССЫЛКА Документ.KPI_СмартЗадача
	               |	И KPI_Факты.СтруктураКомпании = &ОбъектУправления
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Регистратор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СмартЗадачиПланы.План КАК План,
	               |	ЕСТЬNULL(ФактыСмартЗадач.Факт, 0) КАК Факт,
	               |	ЕСТЬNULL(ФактыСмартЗадач.Факт, 0) / СмартЗадачиПланы.План * 100 КАК ПроцентВыполнения,
	               |	СмартЗадачиПланы.Регистратор.ВыполнитьДо КАК СрокИсполнения,
	               |	СмартЗадачиПланы.Регистратор.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	СмартЗадачиПланы.Регистратор.НаименованиеЗадачи КАК СмартЗадача,
	               |	СмартЗадачиПланы.Регистратор КАК Регистратор
	               |ИЗ
	               |	СмартЗадачиПланы КАК СмартЗадачиПланы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ФактыСмартЗадач КАК ФактыСмартЗадач
	               |		ПО СмартЗадачиПланы.Регистратор = ФактыСмартЗадач.Регистратор";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОбъектУправления"          , ОбъектУправления);
	Запрос.УстановитьПараметр("ПериодичностьПланирования" , ПериодичностьПланирования);
	Запрос.УстановитьПараметр("НачалоПериода"             , ГраницыПериода.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"              , ГраницыПериода.КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьГруппировкаЗадач = МакетПланФакты.ПолучитьОбласть("ГрупировкаСмартЗадачи");
	ДетальныеЗаписиЗадач    = МакетПланФакты.ПолучитьОбласть("ДетальльныеЗаписиСмартЗадачи");
	ДокументРезультат.Вывести(ОбластьГруппировкаЗадач);
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ДетальныеЗаписиЗадач.Параметры,Выборка);
		ДокументРезультат.Вывести(ДетальныеЗаписиЗадач);
	КонецЦикла;
		
	//Стандарты
	ОбластьЗаголовок = МакетПланФакты.ПолучитьОбласть("ЗаголовокСтандарт");
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	//
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	KPI_СтруктураКомпанииПринятые.Период КАК Принят,
	|	KPI_СтруктураКомпанииПринятые.Сотрудник КАК Сотрудник,
	|	KPI_СтруктураКомпанииПринятые.СтруктураКомпании КАК СтруктураКомпании
	|ПОМЕСТИТЬ Принятые
	|ИЗ
	|	РегистрСведений.KPI_СтруктураКомпании КАК KPI_СтруктураКомпанииПринятые
	|ГДЕ
	|	НЕ KPI_СтруктураКомпанииПринятые.Уволен
	|	И НЕ KPI_СтруктураКомпанииПринятые.СтруктураУдалена
	|	И НЕ KPI_СтруктураКомпанииПринятые.Сотрудник = ЗНАЧЕНИЕ(Справочник.KPI_Сотрудники.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтруктураКомпании,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	KPI_СтруктураКомпанииУволеные.СтруктураКомпании КАК СтруктураКомпании,
	|	KPI_СтруктураКомпанииУволеные.Сотрудник КАК Сотрудник,
	|	KPI_СтруктураКомпанииУволеные.Период КАК Уволен
	|ПОМЕСТИТЬ Уволеные
	|ИЗ
	|	РегистрСведений.KPI_СтруктураКомпании КАК KPI_СтруктураКомпанииУволеные
	|ГДЕ
	|	KPI_СтруктураКомпанииУволеные.Уволен
	|	И НЕ KPI_СтруктураКомпанииУволеные.СтруктураУдалена
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтруктураКомпании,
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Принятые.Принят,
	|	ЕСТЬNULL(Уволеные.Уволен, ДАТАВРЕМЯ(2999, 12, 31)) КАК Уволен,
	|	Принятые.СтруктураКомпании,
	|	Принятые.Сотрудник
	|ПОМЕСТИТЬ ПериодыРаботыСотрудников
	|ИЗ
	|	Принятые КАК Принятые
	|		ЛЕВОЕ СОЕДИНЕНИЕ Уволеные КАК Уволеные
	|		ПО Принятые.СтруктураКомпании = Уволеные.СтруктураКомпании
	|			И Принятые.Сотрудник = Уволеные.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Принятые
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Уволеные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	KPI_СтандартыСрезПоследних.Стандарт КАК Стандарт,
	|	KPI_СтандартыСрезПоследних.ДатаОценки КАК ДатаОценки,
	|	KPI_СтандартыСрезПоследних.Ответственный КАК Ответственный,
	|	KPI_СтандартыСрезПоследних.Основание,
	|	KPI_СтандартыСрезПоследних.ВесСтандарта КАК ВесСтандарта,
	|	KPI_СтандартыСрезПоследних.Оцениваемый КАК Оцениваемый,
	|	KPI_СтандартыСрезПоследних.ВесОтветственного КАК ВесОценкиОтветственного
	|ПОМЕСТИТЬ СтандартыПлан
	|ИЗ
	|	РегистрСведений.KPI_Стандарты.СрезПоследних(
	|			&КонецПериода,
	|			Основание ССЫЛКА Документ.KPI_Планирование
	|				И (ДатаОценки МЕЖДУ &НачалоПериода И &КонецПериода)
	|				И Оцениваемый = &ОбъектУправления
	|				И ПериодичностьПланирования = &ПериодичностьПланирования) КАК KPI_СтандартыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	KPI_СтандартыСрезПоследних.Ответственный,
	|	KPI_СтандартыСрезПоследних.Стандарт,
	|	KPI_СтандартыСрезПоследних.ДатаОценки,
	|	KPI_СтандартыСрезПоследних.Основание,
	|	KPI_СтандартыСрезПоследних.ВесСтандарта,
	|	KPI_СтандартыСрезПоследних.Оцениваемый,
	|	KPI_СтандартыСрезПоследних.ВесОтветственного
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	KPI_Факты.КлючАналитики.Аналитика1 КАК Стандарт,
	|	KPI_Факты.КлючАналитики.Аналитика2 КАК ПереодичностьПланирования,
	|	KPI_Факты.КлючАналитики.Аналитика3 КАК Ответственный,
	|	KPI_Факты.КлючАналитики.Аналитика4 КАК Оцениваемый,
	|	KPI_Факты.КлючАналитики.Аналитика5 КАК ДатаОценки,
	|	KPI_Факты.Факт КАК Факт,
	|	KPI_Факты.ОценкаСтандарта,
	|	KPI_Факты.Регистратор,
	|	KPI_Факты.Комментарий
	|ПОМЕСТИТЬ СтандартыФакт
	|ИЗ
	|	РегистрНакопления.KPI_Факты КАК KPI_Факты
	|ГДЕ
	|	KPI_Факты.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И KPI_Факты.Регистратор ССЫЛКА Документ.KPI_ВводОценокСтандартов
	|	И KPI_Факты.ЦелевойПоказатель = ЗНАЧЕНИЕ(Справочник.KPI_ЦелевыеПоказатели.Стандарт)
	|	И KPI_Факты.КлючАналитики.Аналитика4 = &ОбъектУправления
	|	И KPI_Факты.КлючАналитики.Аналитика2 = &ПериодичностьПланирования
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтандартыПлан.Стандарт КАК Стандарт,
	|	СтандартыПлан.Ответственный КАК Ответственный,
	|	СтандартыПлан.ВесСтандарта,
	|	ЕСТЬNULL(СтандартыФакт.Факт, 0) КАК Факт,
	|	СтандартыПлан.ВесОценкиОтветственного,
	|	СтандартыФакт.ОценкаСтандарта,
	|	СтандартыПлан.Основание,
	|	СтандартыФакт.Регистратор КАК ДокументВводОценокСтандартов,
	|	СтандартыПлан.ДатаОценки,
	|	СтандартыФакт.Комментарий
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	СтандартыПлан КАК СтандартыПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтандартыФакт КАК СтандартыФакт
	|		ПО СтандартыПлан.Стандарт = СтандартыФакт.Стандарт
	|			И СтандартыПлан.Ответственный = СтандартыФакт.Ответственный
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Самооценка.Стандарт,
	|	Самооценка.ВесСтандарта,
	|	Самооценка.ОценкаСтандарта КАК Самооценка,
	|	Самооценка.Комментарий КАК КомментарийСамооценки,
	|	ОценкиОтветсвеных.ВесОценкиОтветственного КАК ВесОценкиОтветственного,
	|	ОценкиОтветсвеных.ОценкаСтандарта КАК ОценкаОтвественного,
	|	ОценкиОтветсвеных.Комментарий КАК КомментарийОтветсвенного,
	|	ОценкиОтветсвеных.Ответственный КАК ОтветственныйСтруктураКомпании,
	|	ЕСТЬNULL(ПериодыРаботыСотрудников.СтруктураКомпании.Должность.Наименование, """") + ""
	|("" + ЕСТЬNULL(ПериодыРаботыСотрудников.Сотрудник.ФизическоеЛицо.Наименование, """") + "")
	|"" + ЕСТЬNULL(""("" + ПериодыРаботыСотрудников.Сотрудник.Квалификация.Наименование + "")"", """") КАК ОтвественныйСотрудник
	|ИЗ
	|	ВТ КАК Самооценка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ОценкиОтветсвеных
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПериодыРаботыСотрудников КАК ПериодыРаботыСотрудников
	|			ПО ОценкиОтветсвеных.ДатаОценки <= ПериодыРаботыСотрудников.Уволен
	|				И ОценкиОтветсвеных.ДатаОценки >= ПериодыРаботыСотрудников.Принят
	|				И ОценкиОтветсвеных.Ответственный = ПериодыРаботыСотрудников.СтруктураКомпании
	|		ПО Самооценка.Стандарт = ОценкиОтветсвеных.Стандарт
	|ГДЕ
	|	Самооценка.Ответственный = &ОбъектУправления
	|	И НЕ ОценкиОтветсвеных.Ответственный = &ОбъектУправления";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ОбъектУправления",ОбъектУправления);
	Запрос.УстановитьПараметр("ПериодичностьПланирования",ПериодичностьПланирования);
	ГраницыПериода = KPI_ОбщегоНазначенияСервер.ГраницыПериода(Период,ПериодичностьПланирования);
	Запрос.УстановитьПараметр("НачалоПериода",ГраницыПериода.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода" ,ГраницыПериода.КонецПериода);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ОбластьГрупировкаСтандарты = МакетПланФакты.ПолучитьОбласть("ГрупировкаСтандарты");
	ДокументРезультат.Вывести(ОбластьГрупировкаСтандарты);
	ОбластьДетальныеЗаписиСтандарты = МакетПланФакты.ПолучитьОбласть("ДетальныеЗаписиСтандарты");
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ОбластьДетальныеЗаписиСтандарты.Параметры,Выборка);
		ДокументРезультат.Вывести(ОбластьДетальныеЗаписиСтандарты);
	КонецЦикла;
	
	//КонецСтандарты
	
	KPI_ИнтерфейсВызовСервера.ДобавитьПодписьСформированногоОтчета(ДокументРезультат,Период);
	
	
КонецПроцедуры
